{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"embeddings_batch": {"name": "embeddings_batch:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/flatten/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "embeddings_batch", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose", "op": "Transpose", "input": ["embeddings_batch", "PartitionedCall/onnx_tf_prefix_/Transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Sub", "op": "Sub", "input": ["PartitionedCall/onnx_tf_prefix_/Transpose", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul", "op": "MatMul", "input": ["PartitionedCall/flatten/Reshape", "PartitionedCall/onnx_tf_prefix_/Sub"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose_1", "op": "Transpose", "input": ["PartitionedCall/MatMul", "PartitionedCall/onnx_tf_prefix_/Transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/clip_by_value/Minimum", "op": "Minimum", "input": ["PartitionedCall/onnx_tf_prefix_/Transpose_1", "PartitionedCall/onnx_tf_prefix_/Constant_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/clip_by_value", "op": "Maximum", "input": ["PartitionedCall/clip_by_value/Minimum", "PartitionedCall/onnx_tf_prefix_/Constant"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Sub_1", "op": "Sub", "input": ["PartitionedCall/clip_by_value", "PartitionedCall/onnx_tf_prefix_/Constant_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Mul", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_/Sub_1", "PartitionedCall/onnx_tf_prefix_/Constant_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Round", "op": "Round", "input": ["PartitionedCall/onnx_tf_prefix_/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/onnx_tf_prefix_/Round"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {}}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/flatten/Reshape", "shape": [128, 128], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose/perm", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [128, 1], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose_1/perm", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_1", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_2", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_3", "shape": [], "dtype": "float32"}]}]}